source/WebServiceTestHarness/CodeCowboy.WebServiceTestHarness/Samples/NumberServiceTestTemplate-01.xml

<?xml version="1.0" encoding="utf-8" ?>
<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
  <s:Body>
    <Add xmlns="http://tempuri.org/">
      <operands xmlns:a="http://schemas.datacontract.org/2004/07/NumberService" xmlns:i="http://www.w3.org/2001/XMLSchema-instance">
        <a:Answer i:nil="$(3)"/>
        <a:Operand1>$(1)</a:Operand1>
        <a:Operand2>$(2)</a:Operand2>
      </operands>
    </Add>
  </s:Body>
</s:Envelope>
